Repository: srinathj007/InvoiceGeneratorApp
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: Invoice Generator
te: ఇన్వాయిస్ జనరేటర్

source: Welcome Back
te: స్వాగతం

# signInToPortfolio
source: Sign in to your portfolio
te: మీ పోర్ట్‌ఫోలియోలోకి సైన్ ఇన్ చేయండి

source: Email Address
te: ఇమెయిల్ చిరునామా

source: Password
te: పాస్వర్డ్

# enterPassword
source: Enter your password
te: మీ పాస్వర్డ్ నమోదు చేయండి

source: Forgot Password?
te: పాస్వర్డ్ మర్చిపోయారా?

source: Sign In
te: సైన్ ఇన్

# dontHaveAccount
source: Don't have an account?
te: ఖాతా లేదా?

source: Sign Up
te: సైన్ అప్

source: Secure Finance
te: సురక్షిత ఆర్థికం

# secureFinanceDesc
source: Experience your wealth grow in a safe and high-motion digital environment.
te: సురక్షితమైన మరియు వేగవంతమైన వాతావరణంలో మీ సంపదను పెంచుకోండి.

source: Create Account
te: ఖాతా సృష్టించండి

# joinCommunity
source: Join our premium finance community
te: మా ప్రీమియం ఫైనాన్స్ కమ్యూనిటీలో చేరండి

source: Full Name
te: పూర్తి పేరు

# enterName
source: John Doe
te: జాన్ డో

# createPassword
source: Create a password
te: పాస్వర్డ్ సృష్టించండి

# alreadyHaveAccount
source: Already have an account?
te: ఖాతా ఉందా?

# joinFuture
source: Join the Future
te: భవిష్యత్తులో చేరండి

# joinFutureDesc
source: Create an account and access premium financial tools designed for modern growth.
te: ఖాతాను సృష్టించండి మరియు ఆధునిక వృద్ధి కోసం రూపొందించిన ప్రీమియం ఆర్థిక సాధనాలను యాక్సెస్ చేయండి.

source: Settings
te: సెట్టింగ్‌లు

source: Business Profile
te: వ్యాపార ప్రొఫైల్

source: Edit Profile
te: ప్రొఫైల్ సవరించండి

source: Log Out
te: లాగ్ అవుట్

# logoutConfirmation
source: Are you sure you want to log out?
te: మీరు ఖచ్చితంగా లాగ్ అవుట్ చేయాలనుకుంటున్నారా?

source: Cancel
te: రద్దు చేయండి

source: Annual Earnings
te: వార్షిక ఆదాయం

source: Monthly Earnings
te: నెలవారీ ఆదాయం

source: Real-time data
te: రియల్ టైమ్ డేటా

source: New Invoice
te: కొత్త ఇన్వాయిస్

source: Clients
te: ఖాతాదారులు

source: Recent Activity
te: ఇటీవలి కార్యకలాపం

source: No recent invoices
te: ఇటీవలి ఇన్వాయిస్‌లు లేవు

source: Invoice Details
te: ఇన్వాయిస్ వివరాలు

source: Delete
te: తొలగించు

source: Edit
te: సవరించు

# viewAndPrint
source: View Full Invoice & Print
te: పూర్తి ఇన్వాయిస్ చూడండి & ప్రింట్ చేయండి

source: Delete Invoice
te: ఇన్వాయిస్ తొలగించండి

# deleteConfirmation
source: Delete Invoice #{number}?
te: ఇన్వాయిస్ #{number} తొలగించాలా?

# deleteSuccess
source: Deleted successfully
te: విజయవంతంగా తొలగించబడింది

source: Language
te: భాష

source: Select Language
te: భాషను ఎంచుకోండి

source: ITEM
te: వస్తువు

source: QTY
te: పరిమాణం

source: PRICE
te: ధర

source: TOTAL
te: మొత్తం

source: Share PDF
te: PDF భాగస్వామ్యం చేయండి

source: Print Invoice
te: ఇన్వాయిస్ ప్రింట్ చేయండి

source: Create Invoice
te: ఇన్వాయిస్ సృష్టించండి

source: Customer Details
te: కస్టమర్ వివరాలు

source: Customer Name
te: కస్టమర్ పేరు

source: Enter customer name
te: కస్టమర్ పేరును నమోదు చేయండి

source: Mobile Number
te: మొబైల్ నంబర్

source: Enter mobile number
te: మొబైల్ నంబర్‌ను నమోదు చేయండి

source: Invoice Date
te: ఇన్వాయిస్ తేదీ

source: Add Item
te: వస్తువును జోడించండి

source: Item Name
te: వస్తువు పేరు

source: Add to Invoice
te: ఇన్వాయిస్‌కు జోడించండి

source: No items added
te: వస్తువులు జోడించబడలేదు

source: Subtotal
te: ఉప మొత్తం

source: Discount
te: రాయితి

source: Grand Total
te: గ్రాండ్ మొత్తం

source: Save Invoice
te: ఇన్వాయిస్ సేవ్ చేయండి

# invoiceSaved
source: Invoice saved successfully
te: ఇన్వాయిస్ విజయవంతంగా సేవ్ చేయబడింది

# invoiceUpdated
source: Invoice updated successfully
te: ఇన్వాయిస్ విజయవంతంగా నవీకరించబడింది

# errorSaving
source: Error saving invoice
te: ఇన్వాయిస్ సేవ్ చేయడంలో లోపం

source: Invoices
te: ఇన్వాయిస్‌లు

# searchPlaceholder
source: Search customer, invoice, details...
te: కస్టమర్, ఇన్వాయిస్, వివరాలను శోధించండి...

source: Newest First
te: కొత్తవి ముందు

source: Oldest First
te: పాతవి ముందు

source: Highest Amount
te: అత్యధిక మొత్తం

source: Lowest Amount
te: అత్యల్ప మొత్తం

source: Customer A-Z
te: కస్టమర్ A-Z

source: No invoices found
te: ఇన్వాయిస్‌లు కనుగొనబడలేదు

# startCreatingInvoice
source: Create a new invoice to get started
te: ప్రారంభించడానికి కొత్త ఇన్వాయిస్‌ని సృష్టించండి

source: Error loading invoices
te: ఇన్వాయిస్‌లను లోడ్ చేయడంలో లోపం

source: Filters
te: ఫిల్టర్లు

source: Reset
te: రీసెట్

source: DATE RANGE
te: తేదీ పరిధి

source: This Month
te: ఈ నెల

source: Last Month
te: గత నెల

source: This Year
te: ఈ సంవత్సరం

source: CUSTOM RANGE
te: అనుకూల పరిధి

source: From Date
te: నుండి తేదీ

source: To Date
te: వరకు తేదీ

source: Apply
te: వర్తించు

source: Profile Settings
te: ప్రొఫైల్ సెట్టింగ్‌లు

source: Business Info
te: వ్యాపార సమాచారం

source: Company Logo
te: కంపెనీ లోగో

source: Business Name
te: వ్యాపారం పేరు

# enterBusinessName
source: e.g. Srinath Motors
te: ఉదా. శ్రీనాథ్ మోటార్స్

source: Proprietor Name
te: యజమాని పేరు

# enterProprietorName
source: e.g. Srinath
te: ఉదా. శ్రీనాథ్

# enterGstin
source: e.g. 36BXKPG2180H1ZH
te: ఉదా. 36BXKPG2180H1ZH

source: Custom Fields
te: అనుకూల ఫీల్డ్‌లు

source: Custom Field Label
te: అనుకూల ఫీల్డ్ లేబుల్

# enterCustomFieldLabel
source: e.g. Reference No, Order ID
te: ఉదా. రిఫరెన్స్ నంబర్

source: Custom Field Placeholder
te: అనుకూల ఫీల్డ్ ప్లేస్‌హోల్డర్

# enterCustomFieldPlaceholder
source: e.g. Enter reference or vehicle number
te: ఉదా. రిఫరెన్స్ లేదా వాహన నంబర్ నమోదు చేయండి

source: Business Assets
te: వ్యాపార ఆస్తులు

source: Proprietor Signature
te: యజమాని సంతకం

source: Companion Logos
te: ఇతర లోగోలు

source: Contact Details
te: సంప్రదింపు వివరాలు

source: Contact Numbers
te: సంప్రదింపు సంఖ్యలు

# enterContactNumbers
source: e.g. 9010123456, 7777123456
te: ఉదా. 9010123456

source: Business Address
te: వ్యాపార చిరునామా

# enterBusinessAddress
source: Enter full address...
te: పూర్తి చిరునామాను నమోదు చేయండి...

source: Save Business Profile
te: వ్యాపార ప్రొఫైల్‌ను సేవ్ చేయండి

# profileSaved
source: Profile saved successfully
te: ప్రొఫైల్ విజయవంతంగా సేవ్ చేయబడింది

source: Error loading profile
te: ప్రొఫైల్ లోడ్ చేయడంలో లోపం

source: Error uploading image
te: చిత్రాన్ని అప్‌లోడ్ చేయడంలో లోపం

source: Uploading
te: అప్‌లోడ్ అవుతోంది

# uploadedSuccess
source: uploaded successfully
te: విజయవంతంగా అప్‌లోడ్ చేయబడింది

# businessNameRequired
source: Business Name is required
te: వ్యాపారం పేరు అవసరం

# enterEmailAddress
source: Please enter your email address
te: దయచేసి మీ ఇమెయిల్ చిరునామాను నమోదు చేయండి

# passwordResetSent
source: Password reset link sent! Check your email.
te: పాస్‌వర్డ్ రీసెట్ లింక్ పంపబడింది! మీ ఇమెయిల్‌ని తనిఖీ చేయండి.

# unexpectedError
source: An unexpected error occurred
te: ఊహించని లోపం సంభవించింది

source: Reset Password
te: పాస్‌వర్డ్‌ను రీసెట్ చేయండి

# recoveryInstructions
source: Enter your email to receive recovery instructions
te: రికవరీ సూచనలను స్వీకరించడానికి మీ ఇమెయిల్‌ను నమోదు చేయండి

source: Send Reset Link
te: రీసెట్ లింక్ పంపండి

# rememberPassword
source: Remember your password?
te: మీ పాస్‌వర్డ్ గుర్తుందా?

source: Account Recovery
te: ఖాతా రికవరీ

# recoveryMessage
source: Don't worry! It happens to the best of us. We'll help you get back to your dashboard in no time.
te: చింతించకండి! ఇది మనందరికీ జరుగుతుంది. మీరు త్వరలో డాష్‌బోర్డ్‌కి తిరిగి రావడానికి మేము సహాయం చేస్తాము.

# fillAllFields
source: Please fill in all fields
te: దయచేసి అన్ని ఫీల్డ్‌లను పూరించండి

# registrationSuccess
source: Registration successful! Please check your email for verification.
te: నమోదు విజయవంతమైంది! ధృవీకరణ కోసం దయచేసి మీ ఇమెయిల్‌ని తనిఖీ చేయండి.

# accountExists
source: Account already exists. Try signing in instead.
te: ఖాతా ఇప్పటికే ఉంది. బదులుగా సైన్ ఇన్ చేయడానికి ప్రయత్నించండి.

source: Dashboard
te: డాష్‌బోర్డ్

source: Email
te: ఇమెయిల్

source: User session expired
te: వినియోగదారు సెషన్ గడువు ముగిసింది
